{
  "md": "Today we will be practicing observing multiple things using our five senses. The key to observing is noticing things without putting words to them (which is what we will do in tomorrow's lesson).",
  "title": "Taking your mind out of the equation",
  "category": "Mindfulness",
  "public": true,
  "source": "https://picsum.photos/599",
  "sections": [
    {
      "title": "Physical Warm-up",
      "sets": 2,
      "steps": [
        {
          "SetStep": "jumpingjacks",
          "timer": 30
        },
        {
          "SetStep": "pushups"
        }
      ]
    },
    {
      "title": "Observation",
      "sets": 1,
      "steps": [
        {
          "title": "Observing isn't verbal",
          "shortDescription": "Learn what it is, and what it isn't",
          "md": "No matter what you are doing consciously, your brain is executing, like a super computer, numerous programs on an ongoing loop. You are unaware of nearly all of what your brain is doing, and most of us live our lives as if our perceptions and interpretations accurately represent reality. Though professionals from all fields have tried to create accurate models of the human brain, there is no fully acceptable model that accounts for all of our intricacies. Nevertheless, we have created certain models that at the very least are *effective* in granting us more control over our circumstances in regard to the brain.\n\nOne of the common assumptions in DBT is that there is a difference between:\n1. The physical world\n2. Our **Observation** of the physical world\n3. Our interpretations of the Observation\n\nThe physical world of a baby may consist mainly of a few rooms, people, windows, etc. The baby does not notice most of this most of the time. They are only able to observe so much at a time. And then they are disturbed by hunger, or a loud noise, or a wave of drowsiness. And then when they wake up again, they are able to observe faces, sounds, etc.  Over time, their brain is able to add more and more to their mental model of the world, and eventually themselves.\n\nIn fact, for several months, there are very few interpretations being made. So much is new! Fast-forward to adulthood, and the same baby who looked at the world with wonder is spending nearly all of their day observing very little. The brain has automated nearly everything that happens each day. Everything is easy. Everything is known. Everything has a name. And why not? It's comfortable, and once we are efficient, we can be productive and accomplish our goals!\n\nSometimes it's not that simple. Sometimes we forget to observe. Sometimes, we think we know everything (or at least we know enough to not need to pay attention). And then we become complacent and miss the most obvious of things.\n\nEver notice how most animals are content? They don't get depressed or beat themselves up. All they need is some good food, water, warmth, exercise, and a friend to spend time with. They don't worry about the future. They don't dwell on the past. In some ways, this is the blessing, and the curse of mankind. You are like an animal because you are an animal. And you are more too. \n\nAnimals are content partially because they can observe without worrying beyond their immediate circumstances. You too will need to practice this skill: **Observe**.",
          "script": "",
          "source": "https://picsum.photos/700",
          "vid": 315521077,
          "type": "video"
        },
        {
          "title": "Take a look around",
          "shortDescription": "A short exercise",
          "md": "Take a look around the room you're in. You might notice people, objects, lights, shadows, textures, or more. Try to *keep your mind on what your eyes can see*. Observe and become more aware of your surroundings. Notice if anything is moving, as subtle as that may be.\n\nTake a *deep* breath in. Notice how that makes your body feel.\n\nIf you catch yourself thinking or talking to yourself in your head, try to focus just on observing. Imagine yourself as a baby, one who doesn't have words or memories of what the objects in your field of vision are. Observe without putting words to what you see.\n\nSpend 2-5 minutes just observing without thought. And when you notice yourself thinking, or trying to interpret what you see, or becoming distracted, just slowly shift your attention back towards what you can observe with your eyes.",
          "script": "",
          "source": "https://picsum.photos/700",
          "vid": 315521077,
          "type": "video"
        },
        {
          "title": "The Forgetting Curve",
          "shortDescription": "Prep for Review",
          "md": "Have you ever heard of the [Forgetting Curve](https://elearningindustry.com/forgetting-curve-combat)? Though it is a bit more complicated than this, the term was invented in the 1800's by German Psychologist *Hermann Ebbinghaus*. The relevant part for this program is the idea that we forget what we don't review. And the more we review over time, the more we retain for longer without reviewing.\n\n![Forgetting Curve](the-forgetting-curve.png)\n\nAfter a single day of not reviewing material, about 50% of the material is forgotten. And after a week, only about 10% is retained. To combat this, our DBT programs will not only go over new material, but sometimes repeat information you've already learned, along with daily reviews.\n\n![Combating the Forgetting Curve](combating-the-forgetting-curve.png)\n\nThere are numerous ways you can combat the forgetting curve such as reviewing material on your own, talking with friends about it, teaching others, or even rote memorization of terms. Though we can't force you to actively participate in your learning process, we have created **Review Exercises** to help you actively learn. There are basically two ways most people review material they want to remember:\n1. Recognition of material\n2. Remembering material\n\nRecognition may be doing things like passively watching videos about DBT skills, or reading articles by experts on the matter. In order to increase your retention of skills, **Review Exercises** were created with the intent of you remembering, and generating your own thoughts on material you have learned. At the end of each day's session, we will go over a few questions. Though it may be tempting to read over the questions and have an intuitive response to them, we ask that you formulate a response that would suffice for a short monologue.\n\n### Example:\n**Question:** What are 3 ways in which you personally could practice the skill Observe?\n**Temptation:** Look around. Breath. Notice smells.\n**Better Answer:** I notice that sometimes I get really worked up by my co-worker Samuel. When that happens, I don't really know what to do. Maybe I should practice Observe in this situation. I suppose I could first pay attention to my breathing. If I remember correctly, my breathing usually gets pretty shallow. So I could look for that. Next, I could pay attention to my posture. I think I hunch over too much when I am mad at him, and I avoid eye contact. But that makes me really uncomfortable, so I think I try to not pay attention to the fact that I am avoiding eye contact. I suppose that is me withdrawing, even from myself. And finally, I've noticed my jaw has been really tight lately. I could pay attention to this as well. I wonder if I am clenching my jaw, and if I am, if this is something I could relax and feel better after. Of course, I am practicing Observe, so I am not trying to change my behavior necessarily. For now, I just want to be more self away when it comes to getting worked up at work.\n\nFeel free to write your responses in a journal, say them out loud, or have an internal monologue. Optionally, you can write your responses in a paragraph (or few) below each question. **Note that paragraphs are usually 100-200 words long**. Just make sure your responses are one that if someone else heard, they could follow along with. Good communication with others facilitates good communication with yourself, will lead to better outcomes, and will improve your retention of the material.",
          "script": "",
          "source": "https://picsum.photos/700",
          "vid": 315521077,
          "type": "video"
        },
        {
          "title": "Review",
          "shortDescription": "Generate your own thoughts",
          "questions": [
            "Take note of your recurring thoughts. What is one thought that you have, which you normally accept as true, but that is not actually accurate?",
            "Notice something within your immediate surrounding, preferably something that changes in some way (position, volume, color, etc). Pay attention to it for a minute. What are some strategies that helped you to focus on that one thing?"
          ],
          "source": "https://picsum.photos/700",
          "type": "review"
        }
      ]
    }
  ]
}