{
  "popups/communication": "*Interpersonal Communication* is one of the 4 categories of DBT skills:\n1. Mindfulness\n2. Distress Tolerance\n3. Emotional Regulation\n4. Interpersonal Communication\n\nThough we all know how to communicate, one the biggest problems people in DBT class face is either:\n1. Asking for what you want\n2. Saying no\n\nSome of us have trouble with this on a daily or weekly basis, while others just have trouble when it comes to the big stuff (asking for a raise, a date, etc). Others of us have no trouble doing one of these things, but somehow end up getting poor results anyways. How's your calibration? What are your priorities in having conversations like this?\n\nAnd of course, the bread and butter of DBT Communication Skills - DEARMAN. This is a skill, that when used either premeditatively, or in the spur of the moment, can drastically improve your chances of having positive interactions with others.",
  "popups/mindfulness": "*Mindfulness* is one of the 4 categories of DBT skills:\n1. Mindfulness\n2. Distress Tolerance\n3. Emotional Regulation\n4. Interpersonal Communication\n\nMindfulness skills are the backbone of other DBT skills - like how you need calories in order to move. Having the right amount of calories, and then focusing your energy in fruitful ways is the best use of your caloric intake. Without enough, you would be too tired to act your best. With too many, you are wasting your time overindulging. And even if you have enough, you still need to direct yourself in order to achieve whatever goals you may have - short-term, or long-term.\n\nLikewise, Mindfulness helps to fuel our other DBT skills and to be more effective at them. Being not mindful enough, we can make crass decisions. Being too mindful (don't worry, this rarely happens to DBT students, so just focus on being more mindful) can result in not being as effective. And of course, though mindfulness on its own can feel great, it is better looked at as a tool to help you get what you want.\n\nWhile I say this all, do remember that quite often, just becoming a bit more mindful can be a fix to your current predicament. This can be like how when you get grumpy, you might just need a little snack to help regulate your blood sugar levels. Mindfulness can be like this, though a much greater use of it is as a backdrop towards your other DBT skills."
}